In [1]:
import pandas as pd
stats = pd.read_csv('D:\\Users\\Minerva\\Programming\\Udemy\\Python A-Z Python For Data Science With Real Exercises\\5. Data Frames\\P4-Demographic-Data.csv')

In [2]:
# renaming columns
stats.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [3]:
stats.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [4]:
stats.columns = ['a','b','c','d','e']

In [5]:
stats.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
stats.columns = ['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers','IncomeHroup']
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeHroup'],
      dtype='object')

In [7]:
#----------------------------------------------

In [8]:
# Subsetting dataframes in pandas
# rows, columns, combining the two

In [20]:
# Rows
stats[21:26]

   CountryName CountryCode  BirthRate  InternetUsers          IncomeHroup
21      Belize         BLZ     23.092          33.60  Upper middle income
22     Bermuda         BMU     10.400          95.30          High income
23     Bolivia         BOL     24.236          36.94  Lower middle income
24      Brazil         BRA     14.931          51.04  Upper middle income
25    Barbados         BRB     12.188          73.00          High income

In [21]:
# Ex// print select frame range in reverse
stats[36:31:-1]

      CountryName CountryCode  BirthRate  InternetUsers          IncomeHroup
36    Congo, Rep.         COG     37.011            6.6  Lower middle income
35       Cameroon         CMR     37.236            6.4  Lower middle income
34  Cote d'Ivoire         CIV     37.320            8.4  Lower middle income
33          China         CHN     12.100           45.8  Upper middle income
32          Chile         CHL     13.385           66.5          High income

In [11]:
# Ex// get every 20th row
stats[::20]

    Country Name Country Code  Birth rate  Internet users         Income Group
0          Aruba          ABW      10.244         78.9000          High income
20       Belarus          BLR      12.500         54.1700  Upper middle income
40    Costa Rica          CRI      15.022         45.9600  Upper middle income
60         Gabon          GAB      30.555          9.2000  Upper middle income
80         India          IND      20.291         15.1000  Lower middle income
100        Libya          LBY      21.425         16.5000  Upper middle income
120   Mozambique          MOZ      39.705          5.4000           Low income
140       Poland          POL       9.600         62.8492          High income
160     Suriname          SUR      18.455         37.4000  Upper middle income
180      Uruguay          URY      14.374         57.6900          High income

In [23]:
# How to get column(s) only
stats['CountryName'].head()

0                   Aruba
1             Afghanistan
2                  Angola
3                 Albania
4    United Arab Emirates
Name: CountryName, dtype: object

In [25]:
stats[['CountryName','InternetUsers']].head()

            CountryName  InternetUsers
0                 Aruba           78.9
1           Afghanistan            5.9
2                Angola           19.1
3               Albania           57.2
4  United Arab Emirates           88.0

In [28]:
# Quick access - requires name to be one word
stats.BirthRate.head()

0    10.244
1    35.253
2    45.985
3    12.877
4    11.044
Name: BirthRate, dtype: float64

In [30]:
# Combining the two
# Syntax varName[row:range][[Col,list]]
stats[4:8][['CountryName','InternetUsers']]

            CountryName  InternetUsers
4  United Arab Emirates           88.0
5             Argentina           59.9
6               Armenia           41.9
7   Antigua and Barbuda           63.4

In [31]:
# Order doesn't matter
stats[['CountryName','InternetUsers']][4:8]

            CountryName  InternetUsers
4  United Arab Emirates           88.0
5             Argentina           59.9
6               Armenia           41.9
7   Antigua and Barbuda           63.4